Updating all docs for consistency
